# GraphicDisplayOptionsLighting Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..GraphicDisplayOptionsLighting Property
ParameterTypeId Class See Also
---
"Lighting"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId GraphicDisplayOptionsLighting { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GraphicDisplayOptionsLighting As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ GraphicDisplayOptionsLighting {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace